// Напишите программу, которая определяет, является ли введенный год високосным или нет.

import java.util.Scanner;

public class LeapYear {
    public static void main(String[] args) {
        int year;

        Scanner input = new Scanner(System.in);

        // Вводная информация
        System.out.print("Введите число: ");
        year = input.nextInt();

        // Решение


        // Выводимая информация
    }
}
